nerwalt/chiptool/examples/nrf54l15-app.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf54l15_application</name>
  <series>nrf54l</series>
  <version>1</version>
  <description>System-on-chip with a 32-bit Arm Cortex-M33 microcontroller</description>
  <licenseText>
Copyright (c) 2010 - 2024, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>270</deviceNumInterrupts>
    <sauNumRegions>4</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf54l15_application</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>480</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>GLOBAL_FICR_NS</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FFC000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>UUID[%s]</name>
            <description>Description collection: 128-bit Universally Unique IDentifier (UUID).</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UUID</name>
                <description>Device UUID [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N54L15</name>
                    <description>nRF54L15</description>
                    <value>0x00054B15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM size (KB)</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM size (KB)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte RAM</description>
                    <value>0x00000100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RRAM</name>
            <description>RRAM size (KB)</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RRAM</name>
                <description>RRAM size (KB)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K1524</name>
                    <description>1524 KByte RRAM</description>
                    <value>0x000005F4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ER[%s]</name>
          <description>Description collection: Common encryption root key, word n</description>
          <addressOffset>0x380</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ER</name>
              <description>Encryption Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IR[%s]</name>
          <description>Description collection: Common identity root key, word n</description>
          <addressOffset>0x390</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IR</name>
              <description>Identity Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type</description>
          <addressOffset>0x3A0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DEVICEADDR[%s]</name>
          <description>Description collection: Device address n</description>
          <addressOffset>0x3A4</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVICEADDR</name>
              <description>48 bit device address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>64</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Address of the register which will be written</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster: Data to be written into the register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Data</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>TAGHEADER0</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MFGID</name>
                <description>Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER1</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD4</name>
                <description>Unique identifier byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD5</name>
                <description>Unique identifier byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD6</name>
                <description>Unique identifier byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD7</name>
                <description>Unique identifier byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER2</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD8</name>
                <description>Unique identifier byte 8</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD9</name>
                <description>Unique identifier byte 9</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD10</name>
                <description>Unique identifier byte 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD11</name>
                <description>Unique identifier byte 11</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER3</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD12</name>
                <description>Unique identifier byte 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD13</name>
                <description>Unique identifier byte 13</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD14</name>
                <description>Unique identifier byte 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD15</name>
                <description>Unique identifier byte 15</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XOSC32MTRIM</name>
          <description>XOSC32M capacitor selection trim values</description>
          <addressOffset>0x620</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLOPE</name>
              <description>Slope trim factor on twos complement form</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OFFSET</name>
              <description>Offset trim factor on integer form</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32KTRIM</name>
          <description>XOSC32K capacitor selection trim values</description>
          <addressOffset>0x624</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLOPE</name>
              <description>Slope trim factor on twos complement form</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OFFSET</name>
              <description>Offset trim factor on integer form</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
