nerwalt/chiptool/examples/nrf54l15-app.svd
        <cluster>
          <name>RNGCONTROL</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_RNGCONTROL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>Control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the NDRNG.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LFSREN</name>
                <description>Select between the NDRNG with asynchronous free running oscillators (when 0) and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when 1).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TESTEN</name>
                <description>Select input for conditioning function and continuous tests:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Noise source (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TEST</name>
                    <description>Test data register (test mode).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONDBYPASS</name>
                <description>Conditioning function bypass.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>the conditioning function is used (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>the conditioning function is bypassed (to observe entropy source directly).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTENREP</name>
                <description>Interrupt enable for Repetition Count Test failure.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>INTENPROP</name>
                <description>Interrupt enable for Adaptive Proportion Test failure (1024-sample window).</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>INTENFULL</name>
                <description>Interrupt enable for FIFO full.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SOFTRST</name>
                <description>Software reset:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTEST</name>
                    <description>The continuous test, the conditioning function and the FIFO are reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTENPRE</name>
                <description>Interrupt enable for AIS31 preliminary noise alarm.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>INTENALM</name>
                <description>Interrupt enable for AIS31 noise alarm.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>FORCEACTIVEROS</name>
                <description>Force oscillators to run when FIFO is full.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>HEALTHTESTBYPASS</name>
                <description>Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>AIS31BYPASS</name>
                <description>Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>HEALTHTESTSEL</name>
                <description>Select input to health test module:</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BEFORE</name>
                    <description>Before conditioning.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AFTER</name>
                    <description>After conditioning.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AIS31TESTSEL</name>
                <description>Select input to the AIS31 test module:</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BEFORE</name>
                    <description>Before conditioning.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AFTER</name>
                    <description>After conditioning.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NB128BITBLOCKS</name>
                <description>Number of 128 bit blocks used in AES-CBCMAC post-processing.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>FIFOWRITESTARTUP</name>
                <description>Enable write of the samples in the FIFO during start-up.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOLEVEL</name>
            <description>FIFO level register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOLEVEL</name>
                <description>Number of 32 bits words of random available in the FIFO.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOTHRESHOLD</name>
            <description>FIFO threshold register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOTHRESHOLD</name>
                <description>FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFODEPTH</name>
            <description>FIFO depth register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFODEPTH</name>
                <description>Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>KEY[%s]</name>
            <description>Description collection: Key register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>KEY</name>
                <description>Key register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATA</name>
            <description>Test data register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Test data register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>REPEATTHRESHOLD</name>
            <description>Repetition Test Count Cut-Off value.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000029</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REPEATTHRESHOLD</name>
                <description>Repetition Test Count Cut-Off value.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PROPTHRESHOLD</name>
            <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000319</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PROPTHRESHOLD</name>
                <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATABUSY</name>
                <description>High when data written to TestData register is being processed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATE</name>
                <description>State of the control FSM:</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STARTUP</name>
                    <description>Startup</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLERON</name>
                    <description>Idle (Rings On)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLEROFF</name>
                    <description>Idle (Rings Off)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILLFIFO</name>
                    <description>Fill FIFO</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERROR</name>
                    <description>Error</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REPFAIL</name>
                <description>NIST-800-90B repetition Count Test interrupt status.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PROPFAIL</name>
                <description>NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FULLINT</name>
                <description>FIFO full status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PREINT</name>
                <description>AIS31 preliminary noise alarm interrupt status.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ALMINT</name>
                <description>AIS31 noise alarm interrupt status.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>STARTUPFAIL</name>
                <description>Start-up test failure.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FIFOACCFAIL</name>
                <description>Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0).</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INITWAITVAL</name>
            <description>Initial wait counter value.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITWAITVAL</name>
                <description>Number of clock cycles to wait before sampling data from the noise source.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DISABLEOSC[%s]</name>
            <description>Description collection: Disable oscillator rings #n*32 to #((n+1)*32)-1.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLEOSC</name>
                <description>Disable oscillator rings #n*32 to #((n+1)*32)-1.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SWOFFTMRVAL</name>
            <description>Switch off timer value.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SWOFFTMRVAL</name>
                <description>Number of clk cycles to wait before stopping the rings after the FIFO is full.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKDIV</name>
            <description>Sample clock divider.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLKDIV</name>
                <description>Sample clock divider.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF0</name>
            <description>AIS31 configuration register 0.</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x43401040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTUPTHRESHOLD</name>
                <description>Start-up test threshold.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ONLINETHRESHOLD</name>
                <description>Online threshold.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF1</name>
            <description>AIS31 configuration register 1.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x03C00680</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ONLINEREPTHRESHOLD</name>
                <description>Online repeat threshold.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>HEXPECTEDVALUE</name>
                <description>Expected history value.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF2</name>
            <description>AIS31 configuration register 2.</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x04400340</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HMIN</name>
                <description>Minimum allowed history value.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>HMAX</name>
                <description>Maximum allowed history value.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31STATUS</name>
            <description>AIS31 status register.</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMPRELIMALARMS</name>
                <description>Number of preliminary noise alarms since counter was last cleared.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PRELIMNOISEALARMRNG</name>
                <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>PRELIMNOISEALARMREP</name>
                <description>Last preliminary noise alarm occurred due to consecutive high Χ**2.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000337</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMBOFRINGS</name>
                <description>Generic g_NumRings value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AIS31</name>
                <description>Generic g_AIS31 value.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AIS31FULL</name>
                <description>Generic g_AIS31Full value.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FIFO[%s]</name>
            <description>Description collection: FIFO data</description>
            <addressOffset>0x080</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>FIFO data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
